#include "Table.h"
#include "Cell.h"


void Table::read()
{
	/*
	считывает размернсть
	выдел€ет пам€ть
	построчно считывает
	фиксирует ошибки
	throw exception если не удалось считать
	*/
}

void Table::calculate()
{
	// запуск вычислени€ последовательно дл€ каждой €чейки
}

void Table::write()
{
	// вывод результирующей таблицы на экран
}
Cell* Table::getCell(int row, int col)
{
	//провер€ет, сущестувет ли €чейка с данными координатами
	// возвращает NULL если нет - иначе возвращает указатель на €чейку
}